Repository: Gaoyifei1011/GetStoreApp
Catalog: GetStoreApp/Strings/*/Dialog.resw
Source language: en_us
Languages: ar, zh_hans

source: Argument
ar: الحجة
zh_hans: 参数

source: Argument name
ar: اسم الحجة
zh_hans: 参数名称

source: Cancel
ar: إلغاء
zh_hans: 取消

# CancelDownload
source: Cancel the download
ar: إلغاء التحميل
zh_hans: 取消下载

source: Channel
ar: القناة
zh_hans: 通道

# CheckFileSHA1
source: The SHA1 value of the verified file:
zh_hans: 校验得到的文件SHA1值：

# CheckingFile
source: Please wait while the file is being validated
ar: يرجى الانتظار أثناء التحقق من الملف
zh_hans: 文件正在校验中，请稍候

source: Clean failed
ar: فشل التنظيف
zh_hans: 清理失败

# CleaningNow
source: Cleaning up, please wait...
ar: جارٍ التنظيف، يرجى الانتظار...
zh_hans: 正在清理中，请稍侯...

source: Cleanup now
ar: تنظيف الآن
zh_hans: 立即清理

source: Close dialog
ar: إغلاق الحوار
zh_hans: 关闭对话框

# ClosingWindowContent
source: You still have a task that you haven't completed downloading, do you want to save the download state and force quit the app?
ar: لا يزال لديك مهمة لم تكمل تحميلها، هل ترغب في حفظ حالة التحميل وإجبار التطبيق على الإغلاق؟
zh_hans: 您目前还有尚未完成下载的任务，是否要保存下载状态并强制退出应用？

# ClosingWindowTitle
source: Task downloading prompt
ar: تنبيه تحميل المهمة
zh_hans: 任务下载中提示

source: Continue
ar: متابعة
zh_hans: 继续

# CopyException
source: Copy exception information
ar: نسخ معلومات الاستثناء
zh_hans: 复制异常信息

source: Copy file information
ar: نسخ معلومات الملف
zh_hans: 复制文件信息

# DeleteDownload
source: The selected download records will be permanently deleted, the operation is irrevocable, please proceed with caution.
ar: ستتم إزالة سجلات التحميل المحددة بشكل دائم، العملية لا يمكن التراجع عنها، يرجى توخي الحذر.
zh_hans: 选定的下载记录将被永久删除，该操作不可撤销，请谨慎操作。

# DeleteDownloadWithFile
source: The selected download records (including files) will be permanently deleted. This operation cannot be undone. Please exercise caution.
ar: ستتم إزالة سجلات التحميل المحددة (بما في ذلك الملفات) بشكل دائم. لا يمكن التراجع عن هذه العملية. يرجى توخي الحذر.
zh_hans: 选定的下载记录（包括文件）将被永久删除，该操作不可撤销，请谨慎操作。

# DeleteHistory
source: The selected history records will be permanently deleted, the operation is irrevocable, please proceed with caution.
zh_hans: 选定的历史记录将被永久删除，该操作不可撤销，请谨慎操作。

# DeleteTitle
source: Delete record
ar: حذف السجل
zh_hans: 删除记录

# DesktopAppsContent1
source: Microsoft divides the app into two categories of apps in the latest Microsoft Store, one is the Store app, installing and updating the services that depend on the Store; The other type is the classical desktop application, the installation of this type of application is installed independently, when updating, it is updated inside the application, and the store only provides the download service of the application installation package.
zh_hans: 微软在最新的 Microsoft Store 中将应用分成两类应用，一类是商店应用，安装、更新依赖商店的服务；另一类是传统桌面应用，这类应用的安装是独立安装的，更新时在应用内部更新，商店只提供应用安装包的下载服务。

# DesktopAppsContent2
source: Microsoft has added instructions to the detail page of traditional desktop apps. As shown in the following figure, if a row of small print appears below the app title and the text content is "provided and updated by a developer", the application is a traditional desktop application.
zh_hans: 微软在传统桌面应用的详细介绍页中添加了说明。如下图所示，如若在应用标题下方出现一排小字，文字内容是"由某开发商提供和更新"时，说明该应用就是传统桌面应用。

# DesktopStartupArgsDescription1
source: The desktop application can select the type and channel name you want to get through input parameters, and fill in the corresponding links to facilitate and quickly obtain
ar: يمكن للتطبيق المكتبي اختيار النوع واسم القناة التي ترغب في الحصول عليها من خلال معلمات الإدخال، وملء الروابط المقابلة لتسهيل وسرعة الحصول عليها
zh_hans: 桌面应用可以通过输入参数选定好想要获取的类型、通道名称，填入相应的链接，方便快速获取

# DesktopStartupArgsDescription2
source: Some parameters are optional and are replaced by default parameters when there is no input or input error
ar: بعض المعلمات اختيارية ويتم استبدالها بالمعلمات الافتراضية عند عدم الإدخال أو وجود خطأ في الإدخال
zh_hans: 部分参数为可选参数，在缺省或输入错误时会使用默认参数代替

# DesktopStartupArgsTitle
source: Desktop program parameter description
ar: وصف معلمات برنامج سطح المكتب
zh_hans: 桌面程序参数说明

# DownloadCleanError
source: An error occurred during the download record cleanup. Please check the download record access rights.
ar: حدث خطأ أثناء تنظيف سجلات التحميل. يرجى التحقق من حقوق الوصول إلى سجلات التحميل.
zh_hans: 下载记录在清理的过程中发生了错误，请检查下载记录访问权限。

# DownloadCompletedContent
source: Your current download task is complete. Do you want to download again?
ar: مهمة التحميل الحالية قد اكتملت. هل ترغب في التحميل مرة أخرى؟
zh_hans: 您当前的下载任务已经完成，是否要重新下载？

# DownloadMultiRecordContent
source: You have multiple duplicate download records. Do you want to download again?
ar: لديك سجلات تحميل مكررة متعددة. هل ترغب في التحميل مرة أخرى؟
zh_hans: 您有多条重复的下载记录，是否要重新下载？

# DownloadNotifyTitle
source: Repeat the download prompt
ar: تنبيه إعادة التحميل
zh_hans: 重复下载提示

# DownloadRecord
source: Download records
ar: سجلات التحميل
zh_hans: 下载记录

# DownloadUnfinishedContent
source: Your current download task is not complete. Do you want to download again?
ar: مهمة التحميل الحالية لم تكتمل. هل ترغب في التحميل مرة أخرى؟
zh_hans: 您当前的下载任务尚未完成，是否要重新下载？

source: Exit code:
ar: رمز الخروج:
zh_hans: 退出代码：

source: Experimental features
zh_hans: 实验性功能

# ExperimentalFeaturesDescription
source: Experimental functions description
zh_hans: 实验功能说明

# ExperimentalFeaturesDescription1
source: When downloading files, you need to obtain the network status information of the device, and the application actively stops downloading files when the network is abnormal. Enable this option when the device misjudges the network status.
zh_hans: 下载文件时需要获取设备的网络状态信息，网络异常时应用主动停止下载文件。当设备误判网络状态时，请开启该选项。

# ExperimentalFeaturesDescription2
source: The download file is based on the Aria2 download process, if you want to customize the download tool, please customize the content of the configuration file.
zh_hans: 下载文件是依托Aria2下载进程来实现的，如果要定制化下载工具，请自定义配置文件的内容。

# ExperimentalWarning
source: Note: These are experimental features. Improper operation may cause the application to crash, please restore to the default settings in case of accidents
zh_hans: 注意：这些是实验性功能。操作不当可能会导致应用奔溃，发生意外时请恢复到默认设置

# FileInformationTitle
source: File information
ar: معلومات الملف
zh_hans: 文件信息

source: File name:
ar: اسم الملف:
zh_hans: 文件名：

source: File path:
ar: مسار الملف:
zh_hans: 文件路径：

# FileSHA1
source: File SHA1 value:
ar: قيمة SHA1 للملف:
zh_hans: 文件SHA1值：

source: File size:
ar: حجم الملف:
zh_hans: 文件大小：

# HistoryCleanError
source: An error occurred during the history cleaning process. Please check the history access permissions.
ar: حدث خطأ أثناء عملية تنظيف السجل. يرجى التحقق من أذونات الوصول إلى السجل.
zh_hans: 历史记录在清理的过程中发生了错误，请检查历史记录访问权限。

# HistoryRecord
source: History records
ar: سجلات التاريخ
zh_hans: 历史记录

source: Input content
ar: محتوى الإدخال
zh_hans: 输入内容

# InstallingNotifyContent
source: Your app is being installed and you can do anything else after the installation is complete
ar: يتم تثبيت تطبيقك ويمكنك القيام بأي شيء آخر بعد اكتمال التثبيت
zh_hans: 您的应用正在安装中，安装完成后再进行其他操作

# InstallingNotifyTitle
source: App installation prompts
ar: تنبيهات تثبيت التطبيق
zh_hans: 应用安装提示

source: Is required
ar: مطلوب
zh_hans: 是否必需

# License
source: GetStoreApp License
ar: ترخيص GetStoreApp
zh_hans: 获取商店应用 许可证

source: Link
ar: الرابط
zh_hans: 链接

# LinkContent
source: Need to input the correlative content
ar: [يجب إدخال المحتوى المتعلق]
zh_hans: 需输入相应内容

# LocalFile
source: Locally created files
ar: الملفات التي تم إنشاؤها محليًا
zh_hans: 本地创建的文件

# LocalFileCleanError
source: An error occurred during the clearing of the locally created file. Check the access permission of the locally created file.
ar: حدث خطأ أثناء تنظيف الملف الذي تم إنشاؤه محليًا. تحقق من أذونات الوصول إلى الملف الذي تم إنشاؤه محليًا.
zh_hans: 本地创建的文件在清理的过程中发生了错误，请检查本地创建的文件的访问权限。

source: No
ar: لا
zh_hans: 否

source: OK
ar: موافق
zh_hans: 确定

source: Open download page
ar: فتح صفحة التحميل
zh_hans: 打开下载页面

# ProcessDescription
source: Detail information:
ar: معلومات تفصيلية:
zh_hans: 详细信息：

# ProcessFailedKind
source: Exception type:
ar: نوع الاستثناء:
zh_hans: 异常类型：

# Reason
source: Exception reason:
ar: سبب الاستثناء:
zh_hans: 异常原因：

# RecognizeDesktopApps
source: How to recognize traditional desktop apps?
zh_hans: 如何识别传统桌面应用?

source: Re-download
ar: إعادة التحميل
zh_hans: 重新下载

# Restart
source: Application restart
ar: إعادة تشغيل التطبيق
zh_hans: 重启应用

# RestartContent
source: The app is about to restart, after the restart the app's data will be lost, make sure that your work has been saved in its entirety
ar: التطبيق على وشك إعادة التشغيل، بعد إعادة التشغيل ستفقد بيانات التطبيق، تأكد من حفظ عملك بالكامل
zh_hans: 应用即将重启，重启后应用的数据将会丢失，请确保您的工作内容已经全部保存。

# RestoreDefualt
source: Restore default values
zh_hans: 还原默认值

# RestoreDefaultSuccessfully
source: The default values were successfully restored
zh_hans: 已成功还原默认值

# SelectEmptyContent
source: You have not selected anything, please select it before proceeding
ar: لم تقم بتحديد أي شيء، يرجى تحديده قبل المتابعة
zh_hans: 您没有选择任何内容，请选中后再进行操作

# SelectEmptyTitle
source: Item selection prompts
ar: تنبيهات اختيار العناصر
zh_hans: 项目选择提示

# StartupArgsSample
source: Reference example
ar: مثال مرجعي
zh_hans: 参考样例

# TraceCleanupContent
source: Trace clearing includes history records, download records, and files created locally when an application is downloaded. Select the items you want to clean.
ar: يتضمن تنظيف السجل سجلات التاريخ، سجلات التحميل، والملفات التي تم إنشاؤها محليًا عند تحميل تطبيق. اختر العناصر التي ترغب في تنظيفها.
zh_hans: 痕迹清理包括历史记录、下载记录和应用下载时在本地创建的文件。请选择您要清理的项目。

# TraceCleanupTitle
source: File cleaning prompts
ar: تنبيهات تنظيف الملفات
zh_hans: 痕迹清理

source: Type
ar: النوع
zh_hans: 类型

# ViewDownloadRecord
source: View your download history
ar: عرض تاريخ التحميل الخاص بك
zh_hans: 查看下载记录

source: Yes
ar: نعم
zh_hans: 是

# ConsoleStartupArgsDescription1
source: There are two ways to start the console program, parameter mode and parameterless mode
ar: هناك طريقتان لبدء برنامج وحدة التحكم، وضع المعلمات ووضع بدون معلمات
zh_hans: 控制台程序有两种启动方式，有参数模式和无参数模式

# ConsoleStartupArgsDescription2
source: There are parameter modes that can be selected by entering parameters to obtain the type and channel name, and fill in the corresponding links to quickly obtain them
ar: هناك أوضاع معلمات يمكن تحديدها عن طريق إدخال المعلمات للحصول على النوع واسم القناة، وملء الروابط المقابلة للحصول عليها بسرعة
zh_hans: 有参数模式可以通过输入参数选定好想要获取到类型、通道名称，填入相应的链接即可快速获取

# ConsoleStartupArgsDescription3
source: Some parameters are optional and are replaced by default parameters if they are mistyped
ar: بعض المعلمات اختيارية ويتم استبدالها بالمعلمات الافتراضية إذا تم كتابتها بشكل خاطئ
zh_hans: 部分参数为可选参数，在缺省或输入错误时会使用默认参数代替

# ConsoleStartupArgsDescription4
source: The parameterless mode is quickly obtained by asking
ar: يتم الحصول على وضع بدون معلمات بسرعة من خلال الاستفسار
zh_hans: 无参数模式会通过询问的方式来快速获取

# ConsoleStartupArgsTitle
source: Console program parameter description
ar: وصف معلمات برنامج وحدة التحكم
zh_hans: 控制台程序参数说明

source: Parameterless mode
ar: وضع بدون معلمات
zh_hans: 无参数模式

source: Parameter mode
ar: وضع المعلمات
zh_hans: 有参数模式

# AppInformationTitle
source: App information
ar: معلومات التطبيق
zh_hans: 应用信息

source: Copy app information
ar: نسخ معلومات التطبيق
zh_hans: 复制应用信息

# DoNetVersion
source: .NET version：
ar: إصدار .NET:
zh_hans: .NET 版本：

source: Windows App SDK version：
ar: إصدار Windows App SDK:
zh_hans: Windows 应用 SDK 版本：

source: WinUI3 version：
ar: إصدار WinUI 3:
zh_hans: WinUI3 版本：

# ActionCenter
source: Application notification in action center
ar: إشعار التطبيق في مركز الإشعارات
zh_hans: 操作中心的应用通知

# ActionCenterError
source: The application notification in the action center fails to be cleared. Please manually open the app notification record in the action center
ar: فشل إشعار التطبيق في مركز الإشعارات في الإزالة. يرجى فتح سجل إشعارات التطبيق يدويًا في مركز الإشعارات
zh_hans: 操作中心的应用通知清理失败，请手动打开操作中心清理通知记录

source: Reboot
ar: إعادة تشغيل
zh_hans: 重启

# RebootTitle
source: Restart device prompt
ar: تنبيه إعادة تشغيل الجهاز
zh_hans: 重启设备提示

# UnInstallNeedReboot
source: {0} The application has been uninstalled. Some changes need to be restarted to take effect. Do you need to restart the device?
ar: {0} تم إلغاء تثبيت التطبيق. تحتاج بعض التغييرات إلى إعادة تشغيل لتصبح فعالة. هل تحتاج إلى إعادة تشغيل الجهاز؟
zh_hans: {0}应用已卸载完成，部分更改需要重启后生效，请问您是否需要重启设备？

source: Open settings
ar: فتح الإعدادات
zh_hans: 打开"设置"

# UpgradeNeedReboot
source: {0} The application has been upgraded. Some changes need to be restarted to take effect. Do you need to restart the device?
ar: {0} تم ترقية التطبيق. تحتاج بعض التغييرات إلى إعادة تشغيل لتصبح فعالة. هل تحتاج إلى إعادة تشغيل الجهاز؟

# SearchNeedReboot
source: {0} The application has been installed. Some changes need to be restarted to take effect. Do you need to restart the device?
ar: {0} تم تثبيت التطبيق. تحتاج بعض التغييرات إلى إعادة تشغيل لتصبح فعالة. هل تحتاج إلى إعادة تشغيل الجهاز؟

# AppRunning
source: The application is running
ar: التطبيق قيد التشغيل
